{
  "_class_name": "controlnet",
  "_diffusers_version": "0.14.0",
  "act_fn": "silu",
  "attention_head_dim": 8,
  "block_out_channels": [320, 640, 1280, 1280],
  "conditioning_embedding_out_channels": [16, 32, 96, 256],
  "cross_attention_dim": 1024,
  "down_block_types": [
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "DownBlock2D"
  ],
  "in_channels": 4,
  "layers_per_block": 2,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "out_channels": 4,
  "sample_size": 64,
  "up_block_types": [
    "UpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D",
    "CrossAttnUpBlock2D"
  ],
  "time_embedding_dim": 1280,
  "time_embedding_act_fn": "gelu",
  "use_linear_projection": false
}
